# AllSlotsOnPanelOccupied Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElectricalFailures..::..AllSlotsOnPanelOccupied Property
BuiltInFailures..::..ElectricalFailures Class See Also
---
All slots on panel: [Panel Name] are occupied. Some circuits will be disconnected from this panel.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AllSlotsOnPanelOccupied { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AllSlotsOnPanelOccupied As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AllSlotsOnPanelOccupied {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElectricalFailures Class
Autodesk.Revit.DB Namespace